Tekla.Structures.Plugins.DirectManipulation.Services.Handles.HandleLocationType
Defines a handle by where it is located.
Remarks:
The choice of location type may affect the appearance of the handle.

Tekla.Structures.Plugins.DirectManipulation.Services.Handles.HandleLocationType.InputPoint
The handle is located on top of an object's input point.

Tekla.Structures.Plugins.DirectManipulation.Services.Handles.HandleLocationType.MidPoint
The handle is located at the exact midpoint of an edge or face.

Tekla.Structures.Plugins.DirectManipulation.Services.Handles.HandleLocationType.EndPoint
The handle is located at one end of an open shape.

Tekla.Structures.Plugins.DirectManipulation.Services.Handles.HandleLocationType.PointExtension
The handle extends the clickable area of a point.
Remarks:
For example the face handles of dimension arrows use this so they can be selected more easily.

Tekla.Structures.Plugins.DirectManipulation.Services.Handles.HandleLocationType.Other
The handle is located at another location.

Tekla.Structures.Plugins.DirectManipulation.Services.Handles.HandleLocationType.First
The handle is the first defining an open shape.

Tekla.Structures.Plugins.DirectManipulation.Services.Handles.HandleLocationType.Last
The handle is the last defining an open shape.